import React from "react";
import "./Vacancies.scss";
import PagesHero from "../../PagesHero/PagesHero";
import Container from "../../../Container/Container";
import { Phone } from "lucide-react";
export default function Vacancies() {
  const vacArr = [
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
    {
      text1:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      text2:
        "Текст про обязаности текст про обязаности текст про обязаности текст про обязаности текст про обязаности",
      text3:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      tel: "+7 904 271 35 90",
    },
  ];
  return (
    <section className="vacancies">
      <Container>
        <PagesHero text="Вакансии" />
        <h2 className="inner">Вакансии</h2>
        <div className="vacancies__general">
          {vacArr.map((item, index) => (
            <div key={index} className="vacancies__carts">
              <h3 className="vacancies__title">Должность</h3>
              <h3 className="vacancies__inner">Требования</h3>
              <p className="vacancies__text">{item.text1}</p>
              <h3 className="vacancies__inner">Обязанности</h3>
              <p className="vacancies__text">{item.text2}</p>
              <h3 className="vacancies__inner">Условия</h3>
              <p className="vacancies__text">{item.text3}</p>
              <h3 className="vacancies__inner">Звоните</h3>
              <h4 className="vacancies__telBox">
                <Phone strokeWidth={0.5} absoluteStrokeWidth />
                <a className="vacancies__tel" href={`tel:${item.tel}`}>
                  {item.tel}
                </a>
              </h4>
            </div>
          ))}
        </div>
      </Container>
    </section>
  );
}
